app/controllers/api/characters_controller.rb

    def show
        url = "https://www.breakingbadapi.com/api/characters/#{params[:id]}"

        name = params[:name];
        p params

        @response = Character.find_by(id: params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]